#include "DAC_soft.h"

/*	Массив значений синуса	*/
uint16_t sin_tab[256] = {
	127,130,133,136,139,142,145,148,151,154,157,160,164,166,169,172,175,178,181,184,187,189,192,195,
	197,200,202,205,207,210,212,214,217,219,221,223,225,227,229,231,232,234,236,237,239,240,242,243,
	244,245,246,247,248,249, 250,251,251,252,252,253,253,253,253,253,254,253,253,253,253,252,252,251,
	251,250,249,249,248,247,246,245,243,242,241,239,238,236,235,233,231,230, 228,226,224,222,220,218,
	215,213,211,209,206,204,201,199,196,193,191,188,185,182,180,177,174,171,168,165,162,159,156,153,
	150,147,144,141,137,134,131,128,125,122,119,116,112,109,106,103,100,97,94,91,88,85,82,79,76, 73,
	71,68,65,62,60,57,54,52,49,47,44,42,40,38,35,33,31,29,27,25,23,22,20,18,17,15,14,12,11,10,8,7,6,
	5,4,4,3,2,2,1,1,0,0,0,0,0,0,0,0,0,0,1,1,2,2,3,4,5,6,7,8,9,10,11,13,14,16,17,19,21,22,24,26,28,30,
	32,34,36,39,41,43,46,48,51,53,56,58,61,64,66,69,72,75,78,81,84,87,89,93,96,99,102,105,108,111,114,
	117,120,123,127
};

/*	Массив значений пилы	*/
uint16_t saw_sign[] = {
	5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,
	85,90,95,100,105,110,115,120,125,130,135,140,145,150,155,160,165,
	170,175,180,185,190,195,200,205,210,215,220,225,230,235,240,245,250,255
};

/*	Массив значений обратной пилы	*/
uint16_t revSaw_sign[] = {
	255,250,245,240,235,230,225,220,215,210,205,200,195,190,185,180,175,170,
	165,160,155,150,145,140,135,130,125,120,115,110,105,100,95,90,85,80,75,
	70,65,60,55,50,45,40,35,30,25,20,15,10,5
};

/*	Массив значений треугольного сигнала	*/
uint16_t triangle_sign[] = {
	5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,
	85,90,95,100,105,110,115,120,125,130,135,140,145,150,155,160,165,
	170,175,180,185,190,195,200,205,210,215,220,225,230,235,240,245,250,255,
//------------Обратный ход---------------------
	250,245,240,235,230,225,220,215,210,205,200,195,190,185,180,175,170,
	165,160,155,150,145,140,135,130,125,120,115,110,105,100,95,90,85,80,75,
	70,65,60,55,50,45,40,35,30,25,20,15,10,5, 0
};

static float one_dac_tick;
static uint16_t tim3_counter_period;
static uint16_t *sign_pointer = NULL;	/*	Указатель на массив со значениями выбранного сигнала	*/
static uint32_t array_size = 0;
static bool dma_started = false;

void DAC_stop()
{
	TIM1->DIER &=  ~TIM_DIER_UDE;
	TIM1->CR1 &= ~TIM_CR1_CEN;
}
void DAC_start(signal_t signal, float freq)
{
	if( signal == SAW || signal == REVERSE_SAW ) /* Для обычной и обратной пилы настройки одинаковые	*/
	{
		one_dac_tick = (1000 / freq) / (51);
		sign_pointer = (signal == SAW) ? saw_sign : revSaw_sign;
		array_size = sizeof(saw_sign) / sizeof(uint16_t);
	}
	else if(signal == TRIANGLE)
	{
		/*	Частота таймера базовая будет 64 Мгц. Предделитель допустим всегда 1. Шаг ЦАПа 5
			51*2 = 102 ступенек если выбрать шаг 5. Вычислили тик ЦАПа в мкс чтобы настроить на него таймер. 	*/
		one_dac_tick = (1000 / freq) / (102);
		sign_pointer = triangle_sign;
		array_size = sizeof(triangle_sign) / sizeof(uint16_t);
	}
	else if( signal == SIN )
	{
		one_dac_tick = (1000 / freq) / (256);
		sign_pointer = sin_tab;
		array_size = sizeof(sin_tab) / sizeof(uint16_t);
	}
	tim3_counter_period = one_dac_tick / 0.015625;
	TIM1->PSC = 0;
	TIM1->ARR = tim3_counter_period;
	TIM1->CNT = 0;

	if( !dma_started ) 	/*	Запуск ДМА должен происходить только один раз	*/
	{
		HAL_DMA_Start_IT( htim1.hdma[TIM_DMA_ID_UPDATE], (uint32_t)sign_pointer, (uint32_t)&GPIOB->ODR, array_size );
		dma_started = true;
	}
	TIM1->DIER |=  TIM_DIER_UDE;	/* Разрешаем таймеру триггерить ДМА	*/
	TIM1->CR1 |= TIM_CR1_CEN;		/* Разрешаем таймеру работать	*/
}